emacs_Emacs中优雅地加载GUI配置.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-03-24 三 20:48 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs中优雅地加载GUI配置</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs中优雅地加载GUI配置</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd8c63f8">啥是Emacs Daemon?</a></li>
<li><a href="#orge5a49bf">如何使用Daemon?</a>
<ul>
<li><a href="#orga4520ff">启动SERVER</a></li>
<li><a href="#org80feabc">启动CLIENT</a></li>
</ul>
</li>
<li><a href="#org792e9c0">Daemon存在的问题</a></li>
<li><a href="#org14c358e">解决这个问题!!!</a></li>
<li><a href="#orgef6d871">最后</a></li>
</ul>
</div>
</div>
<p>
大概是一周前，咱为咱的Emacs配置添加了更好的daemon支持，那么下面就简单介绍下吧!
</p>

<div id="outline-container-orgd8c63f8" class="outline-2">
<h2 id="orgd8c63f8">啥是Emacs Daemon?</h2>
<div class="outline-text-2" id="text-orgd8c63f8">
<p>
汝可以理解成让Emacs变为一种C/S架构，汝可以开机时立刻将Emacs以Daemon模式启动，然后汝只需要使用emacsclient来真正使用Emacs就可以了，它的优势是可以让汝启动emcas非常快速，因为汝的所有配置
都已经加载过了(启动Daemon时)。
</p>
</div>
</div>

<div id="outline-container-orge5a49bf" class="outline-2">
<h2 id="orge5a49bf">如何使用Daemon?</h2>
<div class="outline-text-2" id="text-orge5a49bf">
</div>
<div id="outline-container-orga4520ff" class="outline-3">
<h3 id="orga4520ff">启动SERVER</h3>
<div class="outline-text-3" id="text-orga4520ff">
<p>
键入命令:
</p>
<div class="org-src-container">
<pre class="src src-shell">emacs --deamon
</pre>
</div>

<p>
就可以将Emacs以Daemon模式启动，启动完成后汝会发现Emacs并不能直接使用，这就是前面说到的Emacs将会以"Server"的形式运行。
</p>
</div>
</div>

<div id="outline-container-org80feabc" class="outline-3">
<h3 id="org80feabc">启动CLIENT</h3>
<div class="outline-text-3" id="text-org80feabc">
<p>
SERVER启动了之后咱们就可以随时以一种超级快速的方式启动CLIENT了，CLIENT分两种方式，一种是TUI模式和GUI模式，分别对应着字符环境和图形环境的说法。
</p>

<p>
TUI模式
</p>
<div class="org-src-container">
<pre class="src src-shell">emacsclient -t -a <span style="color: #b5bd68;">""</span>
</pre>
</div>

<p>
GUI模式
</p>
<div class="org-src-container">
<pre class="src src-shell">emacsclient -c -a <span style="color: #b5bd68;">""</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org792e9c0" class="outline-2">
<h2 id="org792e9c0">Daemon存在的问题</h2>
<div class="outline-text-2" id="text-org792e9c0">
<p>
  经过前面的介绍咱们知道，所有的配置会在启动Daemon时就被加载(如果没有经过处理)。但是当咱们以TUI的方式启动EMACS,那么GUI的配置就显得有些多余了，所以咱们需要为每个GUI配置加一个判断，当当前环境
是图形环境时再加载，否则就不加载。所以汝可以使用 <b><b>(display-graphic-p)</b></b> 来判断当前环境是否为GUI，然后为每个GUI的配置做单独的判断就可以了。
</p>

<p>
汝以为就完了吗，但实际上这样仍然会有一些问题，就是启动Daemon时Emacs是以TUI的方式启动并加载配置的，所以前面提到的这个函数 将永远返回nil，所以就有第二种解决方案。
</p>

<p>
查阅了一些资料后，咱发现可以获取当前xorg的环境是否为图形环境，来判断Emacs是否处于图形环境中，就像这样 <b><b>(getenv "DISPLAY")</b></b> ，这样汝就可以解决在图形环境下启动Daemon仍被识别为TUI的问题啦！
</p>

<p>
不过不过，汝认为这就完了吗，不不不，实际上这还是会出现一些问题，就是当我们使用emacsclient TUI时，咱们的Emacs就会出现前面遇到的第一个问题了，仍然加载了图形化的配置，这样也不足够优雅，所以就有了
下面的终极解决方案(咱能想到的)。
</p>
</div>
</div>

<div id="outline-container-org14c358e" class="outline-2">
<h2 id="org14c358e">解决这个问题!!!</h2>
<div class="outline-text-2" id="text-org14c358e">
<p>
先来梳理梳理问题，目前问题是不好判断Daemon模式时emacsclient是否以图形化的方式启动的，咱冥思苦想(没办法咱太蠢了)，想了个解决方案: Daemon启动时无需判断是否为TUI还是GUI，而那些GUI的配置我们利用
钩子来加载，这个钩子就是 <b><b>after-make-frame-functions</b></b> ，其作用是当创建了一个frame之后触发一些事，而TUI模式下正好是无法make一个frame的，而emacsclient以GUI模式启动时会触发这个hook，那就
好办了，稍微思考一下，咱们想先构建一个容器：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b294bb;">setq</span> graphic-only-plugins-setting ())
</pre>
</div>

<p>
这个容器的作用是存储GUI的特定配置，例如咱有个看PDF的插件，它必须在GUI下才能使用，咱就将其配置加入到此容器中：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">Emacs&#19979;&#30340;pdf&#26597;&#30475;&#24037;&#20855;&#65292;&#40664;&#35748;&#38750;&#22270;&#24418;&#21270;&#19981;&#24320;&#21551;</span>
(<span style="color: #b294bb;">push</span> '(<span style="color: #b294bb;">use-package</span> 
         pdf-tools 
         <span style="color: #81a2be;">:ensure</span> t 
         <span style="color: #81a2be;">:hook</span> ('doc-view-mode 'pdf-view-mode)) <span style="color: #f0c674;">graphic-only-plugins-setting)</span>
</pre>
</div>

<p>
那么咱们就需要使用到那个钩子啦，我们在那个钩子触发时将这个容器里的所有代码一一Eval一下就OK啦！
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b294bb;">defun</span> <span style="color: #81a2be;">graphic-p</span> ()
  <span style="color: #717171;">"&#21028;&#26029;&#24403;&#21069;&#29615;&#22659;&#26159;&#21542;&#20026;&#22270;&#24418;&#29615;&#22659;"</span>
  (<span style="color: #b294bb;">if</span> (display-graphic-p)
      t))
<span style="color: #5a5b5a;">;; </span><span style="color: #5a5b5a;">&#22270;&#24418;&#21270;&#25554;&#20214;&#29305;&#27530;&#35774;&#32622;</span>
(<span style="color: #b294bb;">if</span> (not (graphic-p))
    (add-hook 'after-make-frame-functions
              (<span style="color: #b294bb;">lambda</span> (new-frame)
                (select-frame new-frame)
                (<span style="color: #b294bb;">dolist</span> (elisp-code graphic-only-plugins-setting)
                  (eval elisp-code))))
  (<span style="color: #b294bb;">dolist</span> (elisp-code graphic-only-plugins-setting)
    (eval elisp-code)))
</pre>
</div>

<p>
这段代码首先判定当前是否为图形环境，如果不是的话则创建这个钩子，这样在用emacsclient TUI模式启动时就暂时不会加载GUI的配置，直到使用emacsclient GUI模式启动时那些GUI配置才会被加载。
</p>
</div>
</div>
<div id="outline-container-orgef6d871" class="outline-2">
<h2 id="orgef6d871">最后</h2>
<div class="outline-text-2" id="text-orgef6d871">
<p>
希望能帮到汝，Emacs很强大，多谢汝喜欢她！
</p>

<p>
<b><b>参考资料</b></b>
</p>

<p>
<a href="http://tigersoldier.is-programmer.com/2010/2/5/tips-on-emacs-daemon.15404.html">画猫不成反类虎 使用Emasc Daemon</a>
</p>

<p>
<a href="http://blog.lujun9972.win/Emacs%E4%B9%8B%E6%80%92/2016/11/04/%E5%88%A4%E6%96%ADemacs%E6%98%AF%E5%90%A6%E5%9C%A8%E5%9B%BE%E5%BD%A2%E7%8E%AF%E5%A2%83%E4%B8%AD%E7%9A%84%E6%AD%A3%E7%A1%AE%E6%96%B9%E6%B3%95/%20Or%20/Emacs%E4%B9%8B%E6%80%92/%E5%88%A4%E6%96%ADemacs%E6%98%AF%E5%90%A6%E5%9C%A8%E5%9B%BE%E5%BD%A2%E7%8E%AF%E5%A2%83%E4%B8%AD%E7%9A%84%E6%AD%A3%E7%A1%AE%E6%96%B9%E6%B3%95/index.html">暗无天日 判断Emacs是否在图形环境中的正确方法</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-07-17 五 00:00</p>
<p class="author">Author: Evan Meek</p>
<p class="date">Created: 2021-03-24 三 20:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
